{
  "intents": [
    {
      "tag": "depression",
      "patterns": ["What is depression?", "Can you explain depression?", "What are the symptoms of depression?", "How can I know if I'm depressed?"],
      "responses": [
        "Depression is a mental health disorder characterized by persistently low mood, loss of interest, and emotional distress. It can significantly impact daily life.",
        "Common symptoms of depression include sadness, fatigue, irritability, and difficulty concentrating. If you experience these symptoms, consider speaking with a professional."
      ]
    },
    {
      "tag": "anxiety",
      "patterns": ["What is anxiety?", "How can I manage anxiety?", "What are anxiety symptoms?", "How does anxiety affect daily life?"],
      "responses": [
        "Anxiety is a feeling of fear, worry, or unease. Deep breathing, mindfulness, and seeking professional guidance can help manage it.",
        "Anxiety symptoms may include restlessness, rapid heartbeat, and excessive worry. Talking to a mental health professional can provide support."
      ]
    },
    {
      "tag": "stress",
      "patterns": ["How do I manage stress?", "What are some stress relief techniques?", "How can I reduce workplace stress?", "What are common stress triggers?"],
      "responses": [
        "To manage stress, consider activities like exercise, meditation, journaling, and speaking to someone you trust.",
        "Identifying triggers, improving time management, and practicing mindfulness are effective ways to reduce stress."
      ]
    },
    {
      "tag": "therapy",
      "patterns": ["What is therapy?", "How can therapy help me?", "What types of therapy are available?", "Should I try therapy?"],
      "responses": [
        "Therapy is a treatment for mental and emotional issues that provides a safe space to express thoughts and develop coping strategies.",
        "Common types of therapy include cognitive-behavioral therapy (CBT), talk therapy, and mindfulness-based practices."
      ]
    },
    {
      "tag": "meditation",
      "patterns": ["What are meditation techniques?", "How can meditation improve my mental health?", "Can meditation reduce anxiety?", "How long should I meditate each day?"],
      "responses": [
        "Meditation can help calm the mind, reduce anxiety, and improve focus. Techniques include mindfulness, breathing exercises, and guided meditation.",
        "Starting with just 5-10 minutes a day can provide noticeable improvements in mental clarity and emotional well-being."
      ]
    },
    {
      "tag": "insomnia",
      "patterns": ["I can't sleep", "How can I improve my sleep?", "What are sleep hygiene tips?", "Why can't I sleep even when I'm tired?"],
      "responses": [
        "To improve sleep, try developing a bedtime routine, reducing screen time, and practicing relaxation techniques.",
        "Avoid caffeine late in the day and maintain a consistent sleep schedule to improve sleep quality."
      ]
    },
    {
      "tag": "self-care",
      "patterns": ["What are some self-care tips?", "How can I take care of myself mentally?", "What activities promote mental well-being?", "How can I practice mindfulness?"],
      "responses": [
        "Self-care strategies include exercising, eating nutritious food, practicing mindfulness, and engaging in activities you enjoy.",
        "Spending time in nature, creative hobbies, and connecting with loved ones are great self-care practices."
      ]
    },
    {
      "tag": "suicidal_thoughts",
      "patterns": ["I feel like giving up", "I'm having suicidal thoughts", "I need help", "I don't know what to do anymore"],
      "responses": [
        "I'm really sorry you're feeling this way. Please consider reaching out to someone you trust or seeking professional help. You're not alone.",
        "Please know that there are people who want to support you. You can contact a helpline for immediate assistance."
      ]
    },
    {
      "tag": "relationship_issues",
      "patterns": ["I'm struggling with my relationship", "My partner and I are fighting", "How do I improve my relationship?", "My relationship is causing me stress"],
      "responses": [
        "It's important to communicate openly with your partner and express your feelings. Consider seeking relationship counseling if needed.",
        "Practicing active listening, empathy, and patience can strengthen relationships."
      ]
    },
    {
      "tag": "anger_management",
      "patterns": ["How can I control my anger?", "I'm always angry", "What are anger management strategies?", "Why do I feel so frustrated all the time?"],
      "responses": [
        "Managing anger can involve mindfulness, relaxation techniques, and learning to express feelings constructively.",
        "Practicing deep breathing exercises and identifying triggers can help you manage anger effectively."
      ]
    },
    {
      "tag": "emotional_exhaustion",
      "patterns": ["Why do I feel emotionally drained?", "How can I cope with emotional exhaustion?", "What causes emotional burnout?", "I feel mentally exhausted, what can I do?"],
      "responses": [
        "Emotional exhaustion can stem from stress, overworking, or constant mental strain. Try taking breaks, practicing mindfulness, and seeking support.",
        "Connecting with loved ones, engaging in hobbies, and focusing on relaxation techniques can help you recharge."
      ]
    },
    {
      "tag": "loneliness",
      "patterns": ["I feel lonely", "How can I overcome loneliness?", "What should I do when I feel isolated?", "How do I make meaningful connections?"],
      "responses": [
        "Building connections through social activities, volunteering, or joining support groups can help reduce loneliness.",
        "Consider reaching out to old friends, participating in hobbies, or speaking to someone about how you feel."
      ]
    },
    {
      "tag": "panic_attacks",
      "patterns": ["What is a panic attack?", "How do I manage panic attacks?", "What causes panic attacks?", "How can I calm myself during a panic attack?"],
      "responses": [
        "Panic attacks are sudden episodes of intense fear that can feel overwhelming. Deep breathing, grounding techniques, and speaking to a professional can help manage them.",
        "During a panic attack, focus on your breathing, remind yourself that it will pass, and try to stay in a calm environment."
      ]
    },
    {
      "tag": "grief",
      "patterns": ["How do I cope with grief?", "I'm struggling with loss", "What are healthy ways to grieve?", "Why am I feeling so overwhelmed after a loss?"],
      "responses": [
        "Grief is a natural response to loss. Allow yourself to feel your emotions, seek support from others, and take your time to heal.",
        "Talking to friends, joining a grief support group, or engaging in therapeutic activities can help you process your feelings."
      ]
    },
    {
      "tag": "perfectionism",
      "patterns": ["How can I stop being a perfectionist?", "I put too much pressure on myself", "Why do I always strive for perfection?", "Is perfectionism affecting my mental health?"],
      "responses": [
        "Perfectionism can create stress and anxiety. Practicing self-compassion, setting realistic goals, and embracing mistakes can help you manage it.",
        "Focusing on progress rather than perfection can improve your mental well-being."
      ]
    },
    {
      "tag": "sleep_problems",
      "patterns": ["I can't sleep at night", "Why do I wake up feeling tired?", "How can I improve my sleep quality?", "What causes insomnia?"],
      "responses": [
        "Improving sleep habits by maintaining a regular bedtime, limiting screen time before bed, and creating a comfortable sleep environment can improve rest.",
        "Relaxation techniques such as deep breathing, meditation, or calming music may help you fall asleep faster."
      ]
    },
    {
      "tag": "self_harm",
      "patterns": ["I'm struggling with self-harm", "How can I stop harming myself?", "What should I do if I feel the urge to self-harm?", "Why do I hurt myself when I'm upset?"],
      "responses": [
        "If you're feeling overwhelmed, consider reaching out to a trusted friend, family member, or mental health professional for support.",
        "Engaging in alternative coping strategies like art, journaling, or talking to someone can help manage these feelings."
      ]
    }
  ]
}